import "./Whoarewe.css";
import SEO from "../seo/SEO"

// Icon
import { GiStarShuriken } from "react-icons/gi";
import { TbTargetArrow } from "react-icons/tb";
import { FaCheck } from "react-icons/fa6";
import { HiMiniCheckBadge } from "react-icons/hi2";
import { GiDeadlyStrike } from "react-icons/gi";
import { RiTeamFill } from "react-icons/ri";


export default function Whoarewe() {
  return (
    <div className="MainBoxWhoarewe" id="Whoarewe">
      <SEO
        title="من نحن"
        description="Almalih Motors - شركة رائدة في تجارة السيارات الإلكترونية في سوريا"
      />
      <div className="ContinerWhoarewe" dir="rtl">
        <div className="TitleWhoarewe">
          <h3>
            نغير الطريقة التي تشتري بها <span>سيارتك!</span>
          </h3>
          <p>
            نقدم خدمات بيع السيارات الجديدية بطريقة سهلة ومريحة, نعمل على راحتك
            ورفاهيتك لذلك يمكنك اختيار سيارتك من خلال موقعنا, مكان مقرنا الرئيسي
            في العاصمة السورية دمشق
          </p>
        </div>
        <div className="SectionOne">
          <div className="TextSectionOne">
            <div className="IconSectionOne">
              <GiStarShuriken />
              <p>من نحن؟</p>
              <GiStarShuriken />
            </div>
            <h3>
              <span>قصة</span> AlmalihMotors
            </h3>
            <p>
              في عام 2026، ظهرت فكرة تحويل سوق السيارات التقليدي إلى تجربة رقمية
              سلسة تُبنى على الشفافية والثقة. رغم التحديات، تم إنشاء منصة
              متكاملة تتيح للعملاء استعراض السيارات، حجزها، وتأمينها بسهولة.
              اليوم، أصبحت الشركة رائدة في تقديم خدمات رقمية شاملة لشراء
              السيارات، مع ضمان الراحة والجودة. رؤيتها تتمثل في تبسيط حياة
              العملاء وجعل تجربة امتلاك السيارات ممتعة وآمنة للجميع.
            </p>
          </div>
          <div
            className="ImagSectionOne"
            style={{
              backgroundImage: "url('/image/imagBMW.jpg')"
            }}
          ></div>
        </div>
        <div className="SectionTow">
          <div className="TitleSectionTow">
            <h3>
              رؤيتنا <span>و</span> رسالتنا
            </h3>
          </div>
          <div className="CardsSectionTow">
            <div className="Card">
              <svg viewBox="0 0 40 40">
                <path d="M20 10C14.4833 10 10 14.4833 10 20C10 25.5167 14.4833 30 20 30C25.5167 30 30 25.5167 30 20C30 19.1 29.8667 18.25 29.65 17.4167L32.2667 14.8C32.95 16.4 33.3333 18.15 33.3333 20C33.3333 27.35 27.35 33.3333 20 33.3333C12.65 33.3333 6.66667 27.35 6.66667 20C6.66667 12.65 12.65 6.66667 20 6.66667C21.85 6.66667 23.6 7.05 25.2 7.73333L22.5833 10.35C21.7667 10.1333 20.9 10 20 10ZM36 15.3833C36.4333 16.85 36.6667 18.4 36.6667 20C36.6667 29.1833 29.1833 36.6667 20 36.6667C10.8167 36.6667 3.33333 29.1833 3.33333 20C3.33333 10.8167 10.8167 3.33333 20 3.33333C21.6 3.33333 23.15 3.56667 24.6167 4L27.2333 1.38333C24.9833 0.5 22.55 0 20 0C8.96667 0 0 8.96667 0 20C0 31.0333 8.96667 40 20 40C31.0333 40 40 31.0333 40 20C40 17.45 39.5 15 38.6167 12.7667L36 15.3833ZM19.55 13.3833C16.0833 13.6167 13.3333 16.4833 13.3333 20C13.3333 23.5167 16.3167 26.6667 20 26.6667C23.6833 26.6667 26.3833 23.9167 26.6167 20.45L24.7167 22.35C22.7667 24.3 19.6 24.3 17.65 22.35C15.7 20.4 15.7 17.2333 17.65 15.2833L19.55 13.3833ZM18.8167 18.8333L21.1667 21.1833L30.6833 11.6667H35L40 6.66667H33.3333V0L28.3333 5V9.31667L18.8167 18.8333Z" />
              </svg>
              <h3>الهدف العام</h3>
              <p>
                تمكين الناس من شراء سياراتهم بطريقة سهلة وموثوقة عبر الإنترنت
              </p>
            </div>
            <div className="Card">
              <svg viewBox="0 0 40 40">
                <path d="M40 30.8333C40 35.8883 35.8883 40 30.8333 40C25.7783 40 21.6667 35.8883 21.6667 30.8333C21.6667 25.7783 25.7783 21.6667 30.8333 21.6667C35.8883 21.6667 40 25.7783 40 30.8333ZM9.16667 21.6667C4.11167 21.6667 0 25.7783 0 30.8333C0 35.8883 4.11167 40 9.16667 40C14.2217 40 18.3333 35.8883 18.3333 30.8333C18.3333 25.7783 14.2217 21.6667 9.16667 21.6667ZM33.3333 6.66667V4.16667C33.3333 1.865 31.4683 0 29.1667 0C26.865 0 25 1.865 25 4.16667V6.66667H33.3333ZM31.6667 10H8.33333C3.73167 10 0 13.7317 0 18.3333V22.3633C2.285 19.8917 5.54333 18.3333 9.16667 18.3333C12.79 18.3333 16.0483 19.8917 18.3333 22.3633V16.6667C18.3333 15.7483 19.0817 15 20 15C20.9183 15 21.6667 15.7483 21.6667 16.6667V22.3633C23.9517 19.8917 27.21 18.3333 30.8333 18.3333C34.4567 18.3333 37.715 19.8917 40 22.3633V18.3333C40 13.7317 36.2683 10 31.6667 10ZM15 6.66667V4.16667C15 1.865 13.135 0 10.8333 0H10.82C8.51833 0 6.63 1.88333 6.62333 4.18333L6.61667 6.66667H15Z" />
              </svg>
              <h3>رؤيتنا</h3>
              <p>
                أن نصبح الشركة الرائدة في مجال تجارة السيارات الإلكترونية في
                المنطقة، ونوفر للعملاء تجربة شراء لا مثيل لها.{" "}
              </p>
            </div>
            <div className="Card">
              <svg viewBox="0 0 40 40">
                <path d="M35 15H25C22.25 15 20 17.25 20 20V40H40V20C40 17.25 37.75 15 35 15ZM35 31.6667H25V28.3333H35V31.6667ZM35 25H25V21.6667H35V25ZM16.6667 6.66667H13.3333C11.5 6.66667 10 5.16667 10 3.33333C10 1.5 11.5 0 13.3333 0H16.6667C18.5 0 20 1.5 20 3.33333C20 5.16667 18.5 6.66667 16.6667 6.66667ZM25 3.33333C27.7667 3.33333 30 5.56667 30 8.33333V11.6667H25C20.4 11.6667 16.6667 15.4 16.6667 20V40H0V8.33333C0 5.56667 2.23333 3.33333 5 3.33333H6.66667C6.66667 7.01667 9.65 10 13.3333 10H16.6667C20.35 10 23.3333 7.01667 23.3333 3.33333H25Z" />
              </svg>
              <h3>رسالتنا</h3>
              <p>
                السيارات الرقمية - وجهتك الجديدة لشراء سيارتك القادمة. تصفح
                واختر وامتلك سيارتك عبر الإنترنت بكل سهولة.{" "}
              </p>
            </div>
          </div>
        </div>
        <div className="SectionThree">
          <div className="TitleSectionThree">
            <h3>أهدافنا</h3>
          </div>
          <div className="BoxTextOne">
            <div className="PartTextOne">
              <FaCheck className="IconCheck" />
              <p>توفير تجربة تصفح وبحث سهلة ومريحة عبر الانترنت</p>
            </div>
            <div className="PartTextTow">
              <FaCheck className="IconCheck" />
              <p>بناء الثقة والمصداقية في عرض السيارات</p>
            </div>
          </div>
          <div className="Boximag">
            <svg
              width="226"
              height="226"
              viewBox="0 0 226 226"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <circle cx="113" cy="113" r="113" fill="#6b6b6b" />
              <circle
                cx="113"
                cy="113"
                r="92.4271"
                fill="#6b6b6b"
                stroke="white"
                stroke-width="1.45806"
                stroke-dasharray="10.21 10.21"
              />
              <circle cx="112.999" cy="113" r="67.8" />
              <path
                d="M110.342 111.177C110.342 112.003 110.67 112.795 111.254 113.379C111.838 113.963 112.63 114.291 113.455 114.291C114.281 114.291 115.073 113.963 115.657 113.379C116.241 112.795 116.569 112.003 116.569 111.177C116.569 110.352 116.241 109.56 115.657 108.976C115.073 108.392 114.281 108.064 113.455 108.064C112.63 108.064 111.838 108.392 111.254 108.976C110.67 109.56 110.342 110.352 110.342 111.177Z"
                stroke="#6b6b6b"
                stroke-width="6.22715"
                stroke-linecap="round"
                stroke-linejoin="round"
              />
              <path
                d="M113.455 95.6094C110.376 95.6094 107.366 96.5224 104.806 98.233C102.245 99.9437 100.25 102.375 99.0718 105.22C97.8935 108.064 97.5852 111.195 98.1859 114.214C98.7865 117.234 100.269 120.008 102.446 122.185C104.624 124.363 107.398 125.845 110.417 126.446C113.437 127.047 116.568 126.738 119.412 125.56C122.257 124.382 124.688 122.386 126.399 119.826C128.109 117.266 129.022 114.256 129.022 111.177"
                stroke="#6b6b6b"
                stroke-width="6.22715"
                stroke-linecap="round"
                stroke-linejoin="round"
              />
              <path
                d="M116.568 83.3263C110.796 82.6787 104.965 83.8409 99.882 86.6522C94.799 89.4634 90.7152 93.7847 88.1956 99.0183C85.6759 104.252 84.8449 110.139 85.8175 115.866C86.7901 121.592 89.5182 126.875 93.6244 130.983C97.7307 135.092 103.012 137.823 108.738 138.798C114.464 139.773 120.352 138.945 125.587 136.428C130.822 133.911 135.145 129.83 137.959 124.748C140.773 119.667 141.938 113.836 141.293 108.064"
                stroke="#6b6b6b"
                stroke-width="6.22715"
                stroke-linecap="round"
                stroke-linejoin="round"
              />
              <path
                d="M122.796 101.836V92.4958L132.137 83.155V92.4958H141.477L132.137 101.836H122.796ZM122.796 101.836L113.455 111.177"
                stroke="#6b6b6b"
                stroke-width="6.22715"
                stroke-linecap="round"
                stroke-linejoin="round"
              />
            </svg>
          </div>
          <div className="BoxTextTow">
            <div className="PartText">
              <FaCheck className="IconCheck" />
              <p>
                تقديم تشكيلة واسعة من السيارات الجديدة والمستعملة عالية الجودة.
              </p>
            </div>
          </div>
        </div>
        <div className="SectionFor">
          <div className="TitleSectionFor">
            <h3>قيمنا</h3>
          </div>
          <div className="BoxSectionFor">
            <div className="PartText">
              <div className="Card">
                <HiMiniCheckBadge className="IconText" />
                <div className="Text">
                  <h4>الثقة</h4>
                  <p>
                    نسعى جاهدين لبناء الثقة مع عملائنا وشركائنا من خلال الشفافية
                    والصدق والالتزام بأعلى معايير الجودة.
                  </p>
                </div>
              </div>
              <div className="Card">
                <GiDeadlyStrike className="IconText" />
                <div className="Text">
                  <h4>الابتكار</h4>
                  <p>
                    نبحث باستمرار عن طرق جديدة لتحسين تجربة عملائنا وتقديم أفضل
                    الخدمات الممكنة.
                  </p>
                </div>
              </div>
              <div className="Card">
                <RiTeamFill className="IconText" />
                <div className="Text">
                  <h4>العمل الجماعي</h4>
                  <p>
                    نؤمن بقوة العمل الجماعي ونقدر مساهمات كل فرد في تحقيق
                    أهدافنا المشتركة.
                  </p>
                </div>
              </div>
            </div>
            <div
              className="Partimag"
              style={{
                backgroundImage: "url('image/imagMarseds.jpg')"
              }}
            ></div>
          </div>
        </div>
      </div>
    </div>
  );
}
